In [ ]:
#PANDAS library(for structured data) more detailed work on pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
s=pd.Series([10,20,30,40], index=['a','b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [4]:
data={ 'name':['laiba', 'sara', 'ali'], 'age': [10,50,40], 'rollno':[1,2,3]} #from dictionary
df=pd.DataFrame(data)
print(df)

    name  age  rollno
0  laiba   10       1
1   sara   50       2
2    ali   40       3

In [5]:
print(df['name'])

0    laiba
1     sara
2      ali
Name: name, dtype: object

In [93]:
#task
data= {'student':['laiba', 'ali' , 'sara', 'ahmad'], 'grade':[100, 80,120, 250],'department':['dcse', 'civil', 'CS', 'data science']}
df= pd.DataFrame(data)
print(df)

NameError: name 'NaN' is not defined

In [7]:
print(df['student'])

0    laiba
1      ali
2     sara
3    ahmad
Name: student, dtype: object

In [8]:
print(df[df['grade']>80])

  student  grade    department
0   laiba    100          dcse
2    sara    120            CS
3   ahmad    250  data science

In [9]:
print(df.set_index['student'])

TypeError: 'method' object is not subscriptable

In [137]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David','Alis'],
'Age': [25, None, 35, 40,None],
'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', None]
}
df = pd.DataFrame(data)

In [138]:
df_age=df[df['Age']>=25]
print(df_age)

      Name   Age      City
0    Alice  25.0  New York
2  Charlie  35.0   Chicago
3    David  40.0   Houston

In [139]:
df_multiple= df[(df['Age']>=30) & (df['City']=='Chicago')]
print(df_multiple)

      Name   Age     City
2  Charlie  35.0  Chicago

In [140]:
#Using .isin() for Multiple Matches:
names=['Alice', 'David']
df_names=df[df['Name'].isin(names)]
print( df_names)

    Name   Age      City
0  Alice  25.0  New York
3  David  40.0   Houston

In [141]:
#Setting and Resetting Index
#Using a Column as the New Index:
df_indexed= df.set_index('Name')
print(df_indexed)

          Age         City
Name
Alice    25.0     New York
Bob       NaN  Los Angeles
Charlie  35.0      Chicago
David    40.0      Houston
Alis      NaN         None

In [142]:
#Resetting an Index
reset_index= df_indexed.reset_index()
print(reset_index)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0      Houston
4     Alis   NaN         None

In [107]:
#Selection of a Subset of Rows and Columns
#Combining Conditions and Column Selections
subset= df[df['Age']>30][['Name', 'City']]
print(subset)

      Name     City
2  Charlie  Chicago
3    David  Houston

In [108]:
#Operations on DataFrames
'''Viewing Data:
head()
and
tail()
Viewing the Top and Bottom of a DataFrame:'''
print(df.head())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [109]:
print(df.tail())

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [110]:
print(df.head(2))

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

In [111]:
print(df.tail(2))

      Name  Age     City
2  Charlie   35  Chicago
3    David   40  Houston

In [112]:
#unique()and value_counts()
#Unique Entries in a Column:
unique_value=df['City'].unique()
print(unique_value)

['New York' 'Los Angeles' 'Chicago' 'Houston']

In [113]:
#Value Counts
#Counting Occurrences:
value_count=df['City'].value_counts()
print(value_count)

City
New York       1
Los Angeles    1
Chicago        1
Houston        1
Name: count, dtype: int64

In [114]:
#Value Counts with Normalization:
count_normalized=df['City'].value_counts(normalize=True)
print(count_normalized)

City
New York       0.25
Los Angeles    0.25
Chicago        0.25
Houston        0.25
Name: proportion, dtype: float64

In [115]:
#4.4 Getting Column and Index Names
#Retrieving Column Names:
columns=df.columns.tolist()
print(columns)

['Name', 'Age', 'City']

In [116]:
#Retrieving Index Values:
indexes=df.index.tolist()
print(indexes)

[0, 1, 2, 3]

In [117]:
#4.5 Sorting and Ordering
#Sorting by a Single Column
sorted=df.sort_values(by='Age')
print(sorted)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston

In [118]:
#Sorting by 'City' then 'Age':
sorted_multiple= df.sort_values(by=['City', 'Age'], ascending=[True, False])
print(sorted_multiple)

      Name  Age         City
2  Charlie   35      Chicago
3    David   40      Houston
1      Bob   30  Los Angeles
0    Alice   25     New York

In [119]:
#Sorting with Missing Values
df.loc[1, 'Salary']=None
df_sorted=df.sort_values(by='Salary', na_position='first')
print(df_sorted)

      Name  Age         City Salary
0    Alice   25     New York    NaN
1      Bob   30  Los Angeles   None
2  Charlie   35      Chicago    NaN
3    David   40      Houston    NaN

In [120]:
#Handling Null Values
#Checking for Null Values
#Detecting Missing Data:
null_values=df.isnull()
print(null_values)

    Name    Age   City  Salary
0  False  False  False    True
1  False  False  False    True
2  False  False  False    True
3  False  False  False    True

In [121]:
#Summing Null Values by Column:
null_values=df.isnull().sum()
print("\nCount of missing values per column:")
print(null_values)

Count of missing values per column:
Name      0
Age       0
City      0
Salary    4
dtype: int64

In [122]:
#4.7 Replacing Values
#Filling Missing Values
#Filling with the Mean Value (for numeric columns):
df['Age']=df['Age'].fillna(df['Age'].mean())
print(df)

      Name  Age         City Salary
0    Alice   25     New York    NaN
1      Bob   30  Los Angeles   None
2  Charlie   35      Chicago    NaN
3    David   40      Houston    NaN

In [143]:
#Replacing Specifi c Values:
df['City']=df['City'].replace('Houston', 'China')
print(df)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis   NaN         None

In [124]:
#4.8 Dropping Rows and Columns
#Dropping Columns
'''df_dropped= df.drop(columns=['Salary'])
print(df_dropped)'''

"df_dropped= df.drop(columns=['Salary'])\nprint(df_dropped)"

In [144]:
#Dropping Rows with Missing Values:
drop_rows=df.dropna()
print("\nDataFrame after dropping rows with missing values:")
print(drop_rows)

DataFrame after dropping rows with missing values:
      Name   Age      City
0    Alice  25.0  New York
2  Charlie  35.0   Chicago
3    David  40.0     China

In [148]:
#Dropping a Row by Index:
df_dropped=df.drop(index=1)
print(df)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis   NaN         None

In [149]:
#5. Missing Data & Its Handling
#5.1 Detecting Missing Data
#Using isnull() andnotnull()
missing=df.isnull()
print(missing)

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False  False
4  False   True   True

In [150]:
notmissing=df.notnull()
print(notmissing)

   Name    Age   City
0  True   True   True
1  True  False   True
2  True   True   True
3  True   True   True
4  True  False  False

In [151]:
#5.2 Handling Missing Data
#Dropping Missing Data
##Drop rows if any column is missing:
dropping=df.dropna()
print(dropping)
#Drop columns with any missing values:
dropping_cols=df.dropna(axis=1)
print(dropping_cols)

      Name   Age      City
0    Alice  25.0  New York
2  Charlie  35.0   Chicago
3    David  40.0     China
      Name
0    Alice
1      Bob
2  Charlie
3    David
4     Alis

In [152]:
#Filling Missing Data
#Fill with a Constant Value:
df_fill_const=df.fillna(value={'Age':0 , 'Salary':5000})
print(df_fill_const)

      Name   Age         City
0    Alice  25.0     New York
1      Bob   0.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis   0.0         None

In [153]:
#Forward-fill and Backward-fill:
#df_ffill=df.fillna(method='ffill')
#print(df_ffill)
df_fill = df.ffill() #Replaces missing values with the previous non-null value
print(df_fill)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  25.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis  40.0        China

In [156]:
df_bfill = df.bfill()
print(df_bfill)       #Replaces missing values with the next non-null value

      Name   Age         City
0    Alice  25.0     New York
1      Bob  35.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis  35.0         None

In [159]:
#5.3 Advanced Techniques
#Combining Multiple Methods:
for column in df.columns:
    if df[column].dtype in ['float64', 'int64']:
      df[column]= df[column].fillna(df[column].median())
    else:
      df[column]= df[column].fillna(df[column].mode()[0])
print(df)

      Name   Age         City
0    Alice  25.0     New York
1      Bob  35.0  Los Angeles
2  Charlie  35.0      Chicago
3    David  40.0        China
4     Alis  35.0      Chicago